In [1]:
import pandas as pd

Ans1

In [2]:
data = [4, 8, 15, 16, 23, 42]
series = pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Ans2

In [3]:
my_list = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
my_series = pd.Series(my_list)
print(my_series)

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

Ans3

In [6]:
dict1 = {"Name":['Alice','Bob',"Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]}
df = pd.DataFrame(dict1)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Ans4

In Pandas, a DataFrame is a two-dimensional labeled data structure with columns of potentially different types.
It is similar to a spreadsheet or SQL table, and is one of the most commonly used Pandas objects for data analysis.

A DataFrame is different from a Pandas Series in that a Series is a one-dimensional labeled array that can hold any data type,
while a DataFrame is a two-dimensional labeled data structure that consists of rows and columns, where each column can have
a different data type.

In [8]:
import pandas as pd

# Create a Pandas Series
fruits = pd.Series(['apple', 'banana', 'cherry', 'date', 'elderberry'])

# Create a Pandas DataFrame
df = pd.DataFrame({'fruits': ['apple', 'banana', 'cherry', 'date', 'elderberry'],
                   'count': [10, 5, 12, 8, 4],
                   'price': [0.5, 0.25, 0.75, 1.0, 0.1]})

# Print the Series and DataFrame
print(fruits)
print("*"*30)
df

0         apple
1        banana
2        cherry
3          date
4    elderberry
dtype: object
******************************

       fruits  count  price
0       apple     10   0.50
1      banana      5   0.25
2      cherry     12   0.75
3        date      8   1.00
4  elderberry      4   0.10

Ans5

In [10]:
print(df.head())
print("*"*30)
print(df.tail())
print("*"*30)
print(df.info())
print("*"*30)
print(df.shape)
print("*"*30)
print(df.describe())
print("*"*30)
print(df.corr())

       fruits  count  price
0       apple     10   0.50
1      banana      5   0.25
2      cherry     12   0.75
3        date      8   1.00
4  elderberry      4   0.10
******************************
       fruits  count  price
0       apple     10   0.50
1      banana      5   0.25
2      cherry     12   0.75
3        date      8   1.00
4  elderberry      4   0.10
******************************
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   fruits  5 non-null      object
 1   count   5 non-null      int64
 2   price   5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes
None
******************************
(5, 3)
******************************
          count     price
count   5.00000  5.000000
mean    7.80000  0.520000
std     3.34664  0.365034
min     4.00000  0.100000
25%     5.00000  0.250000
50%     8.00000  0.500000
75%    10.00000  0.750000
max    12.00000  1.000000
******************************
          count     price
count  1.000000  0.689648
price  0.689648  1.000000

Ans6

Both Series and DataFrame are mutable in nature in Pandas, while Panel is deprecated in the latest version of Pandas and
has been replaced by Panel4D and PanelND. However, even Panel4D and PanelND are also mutable in nature.

In other words, all three - Series, DataFrame, and Panel(deprecated) - are mutable in nature.

Ans7

In [12]:
names = pd.Series(['Alice', 'Bob', 'Charlie', 'David'])

ages = pd.Series([25, 30, 35, 40])

countries = pd.Series(['USA', 'Canada', 'UK', 'Australia'])

df = pd.concat([names, ages, countries], axis=1)

df.columns = ['Name', 'Age', 'Country']

# Print the resulting DataFrame
df

      Name  Age    Country
0    Alice   25        USA
1      Bob   30     Canada
2  Charlie   35         UK
3    David   40  Australia